/** @file

;******************************************************************************
;* Copyright (c) 2014, Insyde Software Corp. All Rights Reserved.
;*
;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
;* transmit, broadcast, present, recite, release, license or otherwise exploit
;* any part of this publication in any form, by any means, without the prior
;* written permission of Insyde Software Corporation.
;*
;******************************************************************************
*/

/=#

#string STR_C4_ENABLE_STRING                               #language en-US        "_CST - C4 Latency Value"
                                                           #language fr-FR        "_CST - C4 Valeur Retardee"
                                                           #language it-IT        "_CST - C4 Latency Value"
                                                           #language es-ES        "Valor de Estado latente de _CST - C4"
                                                           #language de-DE        "_CST -C4 Latenzzeit Wert"
                                                           #language pt-PT        "_CST-C4 Valor Legado"
#string STR_C4_ENABLE_HELP                                 #language en-US        "   "
                                                           #language fr-FR        "   "
                                                           #language it-IT        "   "
                                                           #language es-ES        "   "
                                                           #language de-DE        "   "
                                                           #language pt-PT        "   "
#string STR_CSTATES_TEXT                                   #language en-US        "C-States Enable"
                                                           #language fr-FR        "C-States Activer"
                                                           #language it-IT        "C-States Abilitare"
                                                           #language es-ES        "C-States Permitir"
                                                           #language de-DE        "C-States Aktivieren"
                                                           #language pt-PT        "C-Estado Permitir"
#string STR_S0_TEXT                                        #language en-US        "S0"
                                                           #language fr-FR        "S0"
                                                           #language zh-TW        "S0"
                                                           #language it-IT        "S0"
                                                           #language es-ES        "S0"										
#string STR_S1_TEXT                                        #language en-US        "S1"
                                                           #language fr-FR        "S1"
                                                           #language zh-TW        "S1"
                                                           #language it-IT        "S1"
                                                           #language es-ES        "S1"
                                                           #language de-DE        "S1"
                                                           #language pt-PT        "S1"
#string STR_S3_TEXT                                        #language en-US        "S3"
                                                           #language fr-FR        "S3"
                                                           #language zh-TW        "S3"
                                                           #language it-IT        "S3"
                                                           #language es-ES        "S3"
                                                           #language de-DE        "S3"
                                                           #language pt-PT        "S3"
#string STR_S4_TEXT                                        #language en-US        "S4"
                                                           #language fr-FR        "S4"
                                                           #language zh-TW        "S4"
                                                           #language it-IT        "S4"
                                                           #language es-ES        "S4"
                                                           #language de-DE        "S4"
                                                           #language pt-PT        "S4"										
#string STR_S5_TEXT                                        #language en-US        "S5"
                                                           #language fr-FR        "S5"
                                                           #language zh-TW        "S5"
                                                           #language it-IT        "S5"
                                                           #language es-ES        "S5"
#string STR_S5_LONG_RUN_TEST_STRING                        #language en-US        "S5 long run test"
#string STR_S5_LONG_RUN_TEST_HELP                          #language en-US        "Enable : force to enable RTC S5 wake up, even if OS disables it. Support ipwrtest to do RTC S5 wakeup."										
#string STR_STATE_AFTER_G3_STRING                          #language en-US        "After G3 On"
                                                           #language fr-FR        "After G3 On"
                                                           #language zh-TW        "After G3 On"
                                                           #language it-IT        "After G3 On"
                                                           #language es-ES        "After G3 On"
#string STR_STATE_AFTER_G3_HELP                            #language en-US        "Specify what state to go to when power is re-applied after a power failure (G3 state)."
                                                           #language fr-FR        "Specify what state to go to when power is re-applied after a power failure (G3 state)."
                                                           #language zh-TW        "Specify what state to go to when power is re-applied after a power failure (G3 state)."
                                                           #language it-IT        "Specify what state to go to when power is re-applied after a power failure (G3 state)."
                                                           #language es-ES        "Specify what state to go to when power is re-applied after a power failure (G3 state)."											
#string STR_POWER_TITLE                                    #language en-US        "Power"
                                                           #language fr-FR        "Allumer"
                                                           #language zh-TW        "\wide電源\narrow"
                                                           #language ja-JP        "\wideパワー\narrow"
                                                           #language it-IT        "Alimentazione"
                                                           #language es-ES        "Energía"
                                                           #language de-DE        "Energieversorgung"
                                                           #language pt-PT        "Potência"
#string STR_DISABLE_ACPI_S1_STRING                         #language en-US        "ACPI S1"
                                                           #language fr-FR        "ACPI S1"
                                                           #language zh-TW        "ACPI S1"
                                                           #language it-IT        "ACPI S1"
                                                           #language es-ES        "ACPI S1"
                                                           #language de-DE        "ACPI S1"
                                                           #language pt-PT        "ACPI S1"
#string STR_DISABLE_ACPI_S3_STRING                         #language en-US        "ACPI S3"
                                                           #language fr-FR        "ACPI S3"
                                                           #language it-IT        "ACPI S3"
                                                           #language es-ES        "ACPI S3"
                                                           #language de-DE        "ACPI S3"
                                                           #language pt-PT        "ACPI S3"
#string STR_S0IX_PROMPT                                    #language en-US        "S0ix"
#string STR_S0IX_HELP                                      #language en-US        "Set platform to configure S0ix supported or not"
#string STR_LOW_POWER_S0_IDLE                              #language en-US        "Low Power S0 Idle Capability" 
#string STR_LOW_POWER_S0_IDLE_HELP                         #language en-US        "This variable determines if we enable ACPI Lower Power S0 Idle Capability (Mutually exclusive with Smart connect)" 
#string STR_NOTIFY_EC                                      #language en-US        "EC Notification"
#string STR_NOTIFY_EC_HELP                                 #language en-US        "Sends EC notification of Low Power S0 Idle State"
#string STR_DEBUG_LT_EC                                    #language en-US        "EC CS Debug Light"
#string STR_DEBUG_LT_EC_HELP                               #language en-US        "When EC enters Low Power S0 Idle State, the CAPS LOCK light will be turned on"
#string STR_EC_LOWPOWER_MODE                               #language en-US        "EC Low Power Mode"
#string STR_EC_LOWPOWER_MODE_HELP                          #language en-US        "This option controls whether EC will go to Low power mode during Low Power S0 Idle State"
#string STR_STATE_AFTER_G3                                 #language en-US        "State After G3"
#string STR_STATE_AFTER_G3_HELP                            #language en-US        "Specify what state to go to when power is re-applied after a power failure (G3 state)"
#string STR_S0_AFTER_G3_STRING                             #language en-US        "S0 State"
#string STR_S5_AFTER_G3_STRING                             #language en-US        "S5 State"
//[-start-170314-IB07400847-add]//
#string STR_LAST_AFTER_G3_STRING                           #language en-US        "Last State"
//[-end-170314-IB07400847-add]//
#string STR_FACP_RTC_S4_STRING                             #language en-US        "FACP - RTC S4 Wakeup"
                                                           #language fr-FR        "FACP - RTC S4 Wakeup"
                                                           #language zh-TW        "FACP - RTC S4 \wide喚醒\narrow"
                                                           #language it-IT        "FACP - RTC S4 Wakeup"
                                                           #language es-ES        "FACP - RTC S4 Wakeup"
                                                           #language de-DE        "FACP - RTC S4 Wecken"
                                                           #language pt-PT        "FACP - RTC S4 Wakeup"
#string STR_FACP_RTC_S4__HELP                              #language en-US        "Value only for ACPI. Enable/Disable for S4 Wakeup from RTC"
                                                           #language fr-FR        "Valeur juste pour ACPI. Activer/Desactiver pour S4 Reveille du RTC"
                                                           #language zh-TW        "\wide值僅僅是給\narrowACPI\wide用的 啟用或取消從\narrowRTC\wide進行\narrowS4\wide甦醒\narrow"
                                                           #language ja-JP        "ACPI \wideのみに関連する値\narrow. RTC\wideによるS4からの起床の有効\narrow/\wide無効\narrow"
                                                           #language it-IT        "Solamente valore per ACPI. Abilitato/Disabilitato per S4 Wakeup da RTC"
                                                           #language es-ES        "Valor solamente para ACPI. Permita/Inhabilite la despertación de S4 desde RTC"
                                                           #language de-DE        "Wert nur für ACPI. Aktiviert/sperrt für S4 Wecken von RTC"
                                                           #language pt-PT        "Valor apenas para ACPI. Aprovar/Desaprovar para S4 Acordar de RTC"
#string STR_WAKE_ON_S5_STRING                              #language en-US        "Auto Wake on S5"
                                                           #language fr-FR        "Auto Wake on S5"
                                                           #language zh-TW        "\wide自動甦醒在\narrowS5"
                                                           #language ja-JP        "S5\wideからの自動起床\narrow"
                                                           #language it-IT        "Accensione automatica per S5"
                                                           #language es-ES        "Se desperte automáticamente en S5"
                                                           #language de-DE        "Automatisches Wachen auf S5"
                                                           #language pt-PT        "Auto acordar S5,"
#string STR_WAKE_ON_S5_HELP                                #language en-US        "Auto wake on S5, By Day of Month or Fixed time of every day"
                                                           #language fr-FR        "Auto-Reveille sur S5, Par Jour du Mois ou Fixé temps du chaque jours"
                                                           #language zh-TW        "\wide以日或月或擇選時間自動在\narrowS5\wide甦醒\narrow"
                                                           #language ja-JP        "\wide日付または毎日の固定時刻での\narrowS5\wideからの自動起床\narrow"
                                                           #language it-IT        "Accensione automatica per S5, tramite giorno del Mese oppure ora fissa di ogni giorno"
                                                           #language es-ES        "Se desperte automáticamente en S5, por Día del Mes o Tiempo fijado diario"
                                                           #language de-DE        "Automatisches Wachen auf S5, bei Tage des Monats oder der örtlich festgelegten Zeit von jedem Tag"
                                                           #language pt-PT        "Auto acordar S5, por Dia de Mês ou tempo Fixado de todos os dias."
#string STR_WAKE_BY_DAY_OF_MONTH_TEXT                      #language en-US        "By Day of Month"
                                                           #language fr-FR        "Par Jour du Mois"
                                                           #language zh-TW        "\wide以月日\narrow"
                                                           #language ja-JP        "\wide日付\narrow"
                                                           #language it-IT        "Tramite Giorno del mese"
                                                           #language es-ES        "Por Día del Mes"
                                                           #language de-DE        "Bei Tage des Monats"
                                                           #language pt-PT        "Por Dia de Mês"
#string STR_WAKE_BY_EVERY_DAY_TEXT                         #language en-US        "By Every Day"
                                                           #language fr-FR        "Par Chaque Jour"
                                                           #language zh-TW        "\wide以日\narrow"
                                                           #language ja-JP        "\wide毎日\narrow"
                                                           #language it-IT        "Ogni giorno"
                                                           #language es-ES        "Por Diario"
                                                           #language de-DE        "Bei jedem Tag"
                                                           #language pt-PT        "Por Todos os Dias"
#string STR_WAKE_ON_S5_TIME_PROMPT                         #language en-US        "  Wake on S5 Time"
                                                           #language fr-FR        "  Reveiller sur S5 Temps"
                                                           #language it-IT        "  Ora di accensione S5"
                                                           #language es-ES        "  Se desperte en Tiempo de S5"
                                                           #language de-DE        "  Wachen auf S5 Zeit"
                                                           #language pt-PT        "  Acordar S5 Tempo"
#string STR_WAKE_DAY_OF_MONTH_PROMPT                       #language en-US        "  Day of Month"
                                                           #language fr-FR        "  Par Jour du Mois"
                                                           #language zh-TW        "\wide以月日\narrow"
                                                           #language it-IT        "  Giorno del mese"
                                                           #language es-ES        "  Day of Month"
                                                           #language de-DE        "  Tage des Monats"
                                                           #language pt-PT        "  Dia de Mês"
//[-start-161118-IB07400817-add]//
#string STR_WAKE_ON_PME_STRING                             #language en-US        "Wake on PME"
                                                           #language fr-FR        "Reveiller sur PME"
                                                           #language zh-TW        "\wide在\narrowPME\wide中甦醒\narrow"
                                                           #language ja-JP        "PME \wideによる起床\narrow"
                                                           #language it-IT        "Accensione PME"
                                                           #language es-ES        "Despertar en PME"
                                                           #language de-DE        "Wachen auf PME"
                                                           #language pt-PT        "Acordar em PME"
#string STR_WAKE_ON_PME_HELP                               #language en-US        "Determines the action taken when the system power is off and a PCI Power Management Enable wake up event occurs."
                                                           #language fr-FR        "Determiner l'action prise quand la puissance système est eteinte et un Puissance Management ActivéPCI reveille les incidents se passer."
                                                           #language zh-TW        "\wide當系統能源被關掉和\narrowPCI\wide能源管理致能甦醒事件發生時\narrow, \wide決定採取何種行動\narrow."
                                                           #language ja-JP        "\wide システムの電源がオフで\narrowPCI Power Management Enable\wide起床イベントが起きた際の動作を決めます\narrow."
                                                           #language it-IT        "Determina l`azione assunta quando il sistema e` spento e un di Gestione Potenza PCI viene abilitato."
                                                           #language es-ES        "Determina la acción tomando cuando la energía del sistema está apagada y se ocurre un acontecimiento despertado de Permiso de Administración de Energía de PCI ."
                                                           #language de-DE        "Stellt die ergriffenen Maßnahmen fest, wenn die Systemsenergie aus ist und ein PCI Energieverwaltung Aktivieren Aufwachen Ereignis auftritt."
                                                           #language pt-PT        "Determina a acção feita quando a potência de sistema é desligada e o evento de acorda de Administração Aprovada de PCI Potência ocorre."
//[-end-161118-IB07400817-add]//       
//[-start-171115-IB07400928-add]//                   
#string STR_ENABLED_BY_OS_TEXT                             #language en-US        "Enabled by OS"
#string STR_FORCE_ENABLED_TEXT                             #language en-US        "Force Enabled"
//[-end-171115-IB07400928-add]//